<div class="pages">
<div class="title">
<h1><a title="Etudes de cas" href="http://switch2osm.org/case-studies/">Etudes de cas</a></h1>
</div>
<div class="meta">&nbsp;</div>
<div class="entry">
<h2>Nestoria.com</h2>
<blockquote>
<p class="hps">&ldquo;Les cartes OSM sont de qualit&eacute; &eacute;gales ou sup&eacute;rieures aux autres services de carte disponibles. Il y a maintenant un solide jeu d'outils et services autour d'OSM qui rend le passage possible.&nbsp;<span id="result_box" lang="fr"><span class="hps">Tout</span> <span class="hps">cela ajout&eacute;</span> donnait le sentiment <span class="hps">irr&eacute;sistible</span> <span class="hps">que</span> <span class="hps">le moment &eacute;tait venu</span> <span class="hps">de passer &agrave; OpenStreetMap</span></span>.&rdquo;</p>
</blockquote>
<p>Lire <a href="http://blog.nestoria.co.uk/post/43883369968/why-and-how-weve-switched-away-from-google-ma">l'histoire de Nestoria du passage de Google Maps &agrave; OpenStreetMap</a>.</p>
<h2>StreetEasy.com</h2>
<blockquote>
<p>&ldquo;Nous &agrave; StreetEasy avont d&eacute;cid&eacute; de faire nos propres cartes, utilisant parmi les autres outils, OpenStreetMap, TileMill, MapBox et Leaflet, plut&ocirc;t que de payer des centaines de milliers de dolars par an &agrave; Google. Et oui, l'argent nous a pouss&eacute; &agrave; le faire, mais nous sommes plus heureux avec le r&eacute;sultat parce que nous contr&ocirc;lons les contenus de nos cartes.&rdquo;</p>
</blockquote>
<p>Lire <a href="https://plus.google.com/u/0/118383351194421484817/posts/foj5A1fURGt">l'histoire de StreetEasy du passage de Google Maps &agrave; OpenStreetMap</a>.</p>
<h2>Fubra</h2>
<blockquote>
<p>&ldquo;La source la plus populaire de tuiles cartographique disponible est OpenStreetMap; nous avons aussi trouv&eacute; que, dans certains endroits, elle est mise &agrave; jour plus fr&eacute;quemment que Google Maps gr&acirc;ce &agrave; sa communaut&eacute; ouverte, o&ugrave; quelques uns de Fubra avaient d&eacute;j&agrave; contribu&eacute;. Open MapQuest utilise la donn&eacute;e d'OpenStreetMap mais ajoute son propre style aux cartes que nous pensons mieux que celui de Google. Et l'autre chose c'est que c'est gratuit!&rdquo;</p>
</blockquote>
<p>Lire <a href="http://www.fubra.com/blog/2011/11/24/google-maps-free-alternatives/">l'histoire de Fubra du passage de Google Maps &agrave; OpenStreetMap</a>.</p>
<h2>Flickr</h2>
<blockquote>
<p class="hps">&ldquo;Un projet fantastique appel&eacute; OpenStreetMap &ndash; une carte du monde libre, &eacute;ditable, fait par les gens. Quelle perspective <span id="result_box" lang="fr"><span class="hps">excitante</span> <span class="hps">pour</span> <span class="hps">&ecirc;tre en mesure de</span> <span class="hps">voir les cartes</span> <span class="hps">qui sont vivantes</span> <span class="hps">et</span> <span class="hps">ont</span> <span class="hps">&eacute;t&eacute; soigneusement</span> <span class="hps">cr&eacute;&eacute;es</span> <span class="hps">par&nbsp;</span><span class="hps">des citoyens</span> <span id="result_box" lang="fr"><span class="hps">cartographes</span></span> <span class="hps">partout dans le monde</span></span>. Quelle perspective encore plus excitante que d'&ecirc;tre capable d'afficher ces cartes dans Flickr!&nbsp;Nous avons creus&eacute; nos cerveaux pour trouver un endroit que nous savions ne pas avoir un tr&egrave;s bon niveau de r&eacute;solution au niveau des rues, et o&ugrave; il avait quelque chose qui se passait maintenant&hellip; Les Jeux Olympiques d'&eacute;t&eacute; de 2008! Ils ont juste d&eacute;but&eacute; &agrave; P&eacute;kin!&rdquo;</p>
</blockquote>
<p>Lire <a href="http://blog.flickr.net/en/2008/08/12/around-the-world-and-back-again/">les raisons de Flickr pour utiliser OpenStreetMap</a>.</p>
<p>&nbsp;</p>
</div>
</div>
