<div class="pages">
<div class="title">
<h1><a href="http://switch2osm.org/other-uses/" title="Other Uses">Autres utilisations</a></h1>
</div>

<div class="meta">&nbsp;</div>

<div class="entry">
<p>Nous nous sommes concentr&eacute;s sur les tuiles, mais comme OpenStreetMap &ndash; uniquement &ndash; donne le droit d&#39;acc&egrave;s &agrave; ces donn&eacute;es cartographiques brutes, vous pouvez construire n&#39;importe quelle application g&eacute;olocalis&eacute;e. Voici les points de d&eacute;part les plus fr&eacute;quents.</p>

<h2>Outils communs</h2>

<ul>
	<li><a href="http://wiki.openstreetmap.org/wiki/Osmosis">Osmosis</a> est une application Java mult-fonctions&nbsp; pour charger les donn&eacute;es OSM dans une base de donn&eacute;es. La plupart des applications des donn&eacute;es OSM utilisent Osmosis d&#39;une mani&egrave;re ou d&#39;une autre.</li>
	<li><a href="http://wiki.openstreetmap.org/wiki/Osmium">Osmium</a> est un framework lexible, qui a rapidement gagn&eacute; en popularit&eacute;, qi offre une alternative tr&egrave;s configurable &agrave; Osmosis.</li>
</ul>

<h2>Geocodage</h2>

<ul>
	<li><a href="http://wiki.openstreetmap.org/wiki/Nominatim">Nominatim</a> est le service de g&eacute;ocodage de OpenStreetMap (associant un lieu de nom avec un couple latitude/longitude). Il a des besoins mat&eacute;riels tr&egrave;s significatifs et de nombreuses personnes choisissent d&#39;utiliser l&#39;instance gratuite offerte par <a href="http://open.mapquestapi.com/nominatim/">MapQuest Open</a>.</li>
</ul>

<h2>Routage</h2>

<ul>
	<li><a href="http://project-osrm.org/">OSRM</a> est un nouveau moteur de routage (calcul d&#39;itin&eacute;raires) tr&egrave;s rapide, con&ccedil;u pour les donn&eacute;es OSM.</li>
	<li><a href="http://sourceforge.net/projects/gosmore/">Gosmore</a> est un moteur de routage bieb &eacute;tabli.</li>
	<li>Des API de routage publiques utilisant les donn&eacute;es OSM sont offertes par <a href="http://developer.mapquest.com/web/products/open/directions-service">MapQuest Open</a> et <a href="http://developers.cloudmade.com/projects/show/routing-http-api">CloudMade</a>.</li>
	<li>Des API de routage sp&eacute;cialis&eacute;es incluent <a href="http://www.cyclestreets.net/api/">le routage v&eacute;lo de CycleStreets</a> (Royaume-Uni)</li>
</ul>

<h2>Biblioth&egrave;ques pour portables</h2>

<ul>
	<li>Les biblioth&egrave;ques iPhone/iOS incluent <a href="https://github.com/route-me/route-me">Route-Me</a> et <a href="http://cloudmade.com/products/iphone-sdk">le SDK de CloudMade</a>.</li>
	<li>Les biblioth&egrave;ques Android incluent <a href="http://code.google.com/p/osmdroid/">osmdroid</a>.</li>
</ul>

<h2>Rendu vecteur</h2>

<ul>
	<li><a href="https://github.com/kothic/kothic-js">Kothic-JS</a> est un excitante nouvelle technologie en d&eacute;velopppement qui effectue le rendu des donn&eacute;es OSM &ldquo;&agrave; la vol&eacute;e&rdquo; en utilisant le HTML5, sans voir le besoin de tuiles raster images.</li>
</ul>

<h2>Contributions &agrave; l&#39;&eacute;dition</h2>

<ul>
	<li><a href="http://wiki.openstreetmap.org/wiki/Potlatch_2">Potlatch 2</a>, l&#39;&eacute;diteur standard sur le site web OSM, est hautement configurable et utilis&eacute; par de nombreux sites pour offrir un moyen personnalis&eacute; d&#39;&eacute;diter les donn&eacute;es OSM.</li>
</ul>

<p>&nbsp;</p>
</div>
</div>
