<div class="pages">
<div class="title">
<h1><a href="http://switch2osm.org/using-tiles/" title="Using Tiles">Utiliser des tuiles</a></h1>
</div>

<div class="meta">&nbsp;</div>

<div class="entry">
<p>Vous pouvez passer un site web &agrave; OpenStreetMap en moins d&#39;une heure. Choisissez une API JavaScript et un fournisseur de tuiles, et vous &ecirc;tes pr&ecirc;ts &agrave; commencer. Ensuite, au fur et &agrave; mesure que vos besoins augmenteront, vous pourrez consid&eacute;rer des tuiles customis&eacute;es, que ce soit d&#39;un fournisseur sp&eacute;cialis&eacute; ou g&eacute;n&eacute;r&eacute;es par vous m&ecirc;me.</p>

<h2>Choisir une API/biblioth&egrave;que</h2>

<p>Contrairement aux fournisseurs de cartes commerciaux, OpenStreetMap ne vous fournit pas une biblioth&egrave;que JavaScript &ldquo;officielle&rdquo; que vous soyez oblig&eacute; d&#39;utiliser. A A la place, vous pouvez utilisez n&#39;importe quelle biblioth&egrave;que qui correspond &agrave; vos besoins. Les deux plus populaires sont OpenLayers et Leaflet. Les deux sont open source.</p>

<div style="clear: both;"><a href="http://switch2osm.org/using-tiles/getting-started-with-openlayers/"><img alt="" border="0" class="alignnone size-full wp-image-140" height="38" src="http://switch2osm.org/wp-content/uploads/2012/01/openlayers-logo.png" style="float: left; margin: 5px;" title="Open Layers logo" width="207" /></a><br />
<a href="http://switch2osm.org/using-tiles/getting-started-with-openlayers/" title="Getting started with OpenLayers">D&eacute;buter avec OpenLayers</a> &ndash; une biblioth&egrave;que tr&egrave;s mature, avec de nombreuses fonctionnalit&eacute;s</div>

<div style="clear: both;"><a href="http://switch2osm.org/using-tiles/getting-started-with-leaflet/"><img alt="" border="0" class="alignnone size-full wp-image-140" height="65" src="http://switch2osm.org/wp-content/uploads/2012/01/leaflet-logo.png" style="float: left; margin: 5px; margin-left: 15px; margin-right: 15px;" title="leaflet logo" width="187" /></a><br />
<a href="http://switch2osm.org/using-tiles/getting-started-with-leaflet/" title="Getting started with Leaflet">D&eacute;buter avec Leaflet</a> &ndash; une biblioth&egrave;que plus r&eacute;cente et l&eacute;g&egrave;re</div>

<div style="clear: both;">Si vous choisissez d&#39;utiliser les tuiles MapQuest Open (g&eacute;n&eacute;r&eacute;es depuis des donn&eacute;es OSM), vous pouvez aussi utiliser <a href="http://developer.mapquest.com/web/products/open/sdk">l&#39;API MapQuest Open</a> qui ajoute des fonctionnalit&eacute;s de routage et de g&eacute;ocodage au jeu de fonctionnalit&eacute;s standard.</div>

<div style="clear: both;">&nbsp;</div>

<div style="clear: both;"><a href="http://mapstraction.com/">Mapstraction</a> est une biblioth&egrave;que qui vous permet de changer de d&#39;un fournisseur cartographique &agrave; un autre sans changer votre code.</div>

<div style="clear: both;">&nbsp;</div>

<h2>Choisir un fournisseur de tuiles</h2>

<p>A l&#39;exception de de besoins de tests tr&egrave;s limit&eacute;s, vous ne devriez pas utilisez les tuiles forunies par le site OpenStreetMap.org lui-m&ecirc;me. OpenStreetMap est un organisme g&eacute;r&eacute; par des volontaires, &agrave; but non lucratif et ne peut pas fournir des tuiles pour une utilisation commerciale de tuiles &agrave; grande &eacute;chelle. Vous devriez plut&ocirc;t utiliser un fournisseur de tuiles tierce-partie qui produit des tuiles depuis des donn&eacute;es OpenStreetMap, ou bien g&eacute;n&eacute;rer les votres.</p>

<p>Forunisseurs gratuits:</p>

<ul>
	<li><a href="http://developer.mapquest.com/web/products/open/map">MapQuest Open</a></li>
</ul>

<p>Fournisseurs payants : <a href="http://switch2osm.org/providers/" title="Providers">voir la liste</a>.</p>

<p>Ou bien allez voir pour d&eacute;couvrir comment <a href="http://switch2osm.org/serving-tiles/" title="Serving Tiles">g&eacute;n&eacute;rer et servir vos propres tuiles</a>.</p>
</div>
</div>
