<div class="pages">
<div class="title">
<h1><a title="Pourquoi changer?" href="http://switch2osm.org/why-switch/">Pourquoi changer?</a></h1>
</div>
<div class="meta">&nbsp;</div>
<div class="entry">
<h2>OpenStreetMap ne vous fera pas payer</h2>
<p>OpenStreetMap est Open Data (dont les donn&eacute;es sont ouvertes). Nous ne vous ferons pas payer pour &ccedil;a &ndash; jamais. Notre licence dit que vous pouvez toujours copier notre donn&eacute;e gratuitement.</p>
<p>Cette donn&eacute;e est transform&eacute;e en &ldquo;tuiles de cartes&rdquo; qui vous montrez sur votre site. Vous pouvez faire cela vous-m&ecirc;me. Ou vous pouvez trouver un sp&eacute;cialiste pour le faire : certains vous feront payer pour cela, d'autres non. Mais le projet OpenStreetMap lui-m&ecirc;me ne vous fera jamais payer pour la donn&eacute;e.</p>
<h2>Faire des cartes qui vous correspondent</h2>
<p>Avec les autres fournisseurs de cartes, la carte ressemble &agrave; ce que le fournisseur veut qu'elle ressemble. Vous serez peut &ecirc;tre capable de faire une petite recoloration rudimentaire. Mais c'est toujours leur style de carte, pas le votre.</p>
<p>Avec OpenStreetMap, vous avez le contr&ocirc;le. Transformer la donn&eacute;e en tuiles peut &ecirc;tre fait de la mani&egrave;re que vous aimez. Vous voulez mettre en valeur les pistes cyclables et diminuer le r&ocirc;le des autoroutes? Pas de probl&egrave;me. (La plupart des autres cartes n'ont m&ecirc;me pas les pistes cyclables.) Vous voulez les arr&ecirc;ts de m&eacute;tro mais voulez ignorer les arr&ecirc;ts de bus? Facile.</p>
<h2>Une donn&eacute;e cartographiques riche, pr&eacute;cise, &agrave; jour</h2>
<p>La plupart de fournisseurs commerciaux font seulement les routes. OpenStreetMap peut avoir les &ldquo;street&rdquo; (route) dans son nom, mais fait bien plus que &ccedil;a. Les &eacute;l&eacute;ments naturels, les routes de bus, les passages pi&eacute;tons, les pistes cyclables, les limites administratives, les magasins, les rivi&egrave;res et canaux&hellip; sont pr&eacute;sents par exemple.</p>
<p>Les fournisseurs commerciaux font aussi la mise &agrave; jour de leur donn&eacute;e chaque mois, si vous &ecirc;tes chanceux. Les nouvelles routes et les b&acirc;timents peuvent &ecirc;tre manquants dans leurs jeux de donn&eacute;es bien apr&egrave;s qu'ils aient ouverts. La donn&eacute;e OpenStreetMap est constamment mis &agrave; jour, et vous pouvez obtenir ces mises &agrave; jour chaque jour, chaque heure et m&ecirc;me chaque minute si vous voulez.</p>
<p>Et ceette donn&eacute;e est fournit par la contribution de nos volontaires (plus de 1,000,000 de personnes enregistr&eacute;es jusqu'&agrave; maintenant, et qui grossit chaque jour) &ndash; les gens qui connaissent <em>vraiment</em> autour de chez eux. C'est pourquoi OpenStreetMap montre souvent des nouveaux d&eacute;veloppements avant tous les fournisseurs commerciaux.</p>
<h2>C'est plus facile que vous ne le pensez</h2>
<p>Il n'y a pas de limtes &agrave; ce que vous pouvez faire avec OpenStreetMap. Pourtant il ne faut pas beaucoup de temps pour d&eacute;buter. Vous pouvez passer &agrave; OSM en moins d'une heure en utilisant des outils comme <a href="http://leaflet.cloudmade.com/">l'API tr&egrave;s facile de Leaflet</a> et les <a href="http://developer.mapquest.com/web/products/open/map">tuiles libres</a> de MapQuest Open. Lisez les reste du site pour d&eacute;buter avec ces possibilit&eacute;s.</p>
</div>
</div>
